import { useState } from "react"
import "../app.css"

const content = [
  [
    `אריס סאן, הוא אחד מאבות המוזיקה והתרבות הישראלית וחלוץ המוזיקה הים-תיכונית בארץ.

מי שהגיע ליפו כנער יווני בן17 והתחיל לנגן גיטרה במועדונים, והפך לאחת מאושיות התרבות הגדולות ביותר בישראל בשנות ה-60 וה-70, 'הוליד' דורות של מוזיקאים חדשים שהביאו את הקולות והניחוחות של הים התיכון והמזרח לקדמת הבמה בישראל.

שעה של סיפורים, סרטונים, שירים, מוזיקה חיה ותמונות שבה נכיר את אריס סאן, דמותו, הסיפור שלו, מאיפה בא, ולאן הלך? וננסה להבין איך הצליח ב-13 שנים להשאיר חותם על ישראל, ולהפוך לפרק בסיפור שלה, שמלווה אותה עד היום ונוכח כמעט בכל פינה.`,
  ],
  [
    `אריס סאן, הוא אחד מאבות המוזיקה והתרבות הישראלית וחלוץ המוזיקה הים-תיכונית בארץ.

מי שהגיע ליפו כנער יווני בן17 והתחיל לנגן גיטרה במועדונים, והפך לאחת מאושיות התרבות הגדולות ביותר בישראל בשנות ה-60 וה-70, 'הוליד' דורות של מוזיקאים חדשים שהביאו את הקולות והניחוחות של הים התיכון והמזרח לקדמת הבמה בישראל.

שעה של סיפורים, סרטונים, שירים, מוזיקה חיה ותמונות שבה נכיר את אריס סאן, דמותו, הסיפור שלו, מאיפה בא, ולאן הלך? וננסה להבין איך הצליח ב-13 שנים להשאיר חותם על ישראל, ולהפוך לפרק בסיפור שלה, שמלווה אותה עד היום ונוכח כמעט בכל פינה.`,
  ],
  [
    `אריס סאן, הוא אחד מאבות המוזיקה והתרבות הישראלית וחלוץ המוזיקה הים-תיכונית בארץ.

מי שהגיע ליפו כנער יווני בן17 והתחיל לנגן גיטרה במועדונים, והפך לאחת מאושיות התרבות הגדולות ביותר בישראל בשנות ה-60 וה-70, 'הוליד' דורות של מוזיקאים חדשים שהביאו את הקולות והניחוחות של הים התיכון והמזרח לקדמת הבמה בישראל.

שעה של סיפורים, סרטונים, שירים, מוזיקה חיה ותמונות שבה נכיר את אריס סאן, דמותו, הסיפור שלו, מאיפה בא, ולאן הלך? וננסה להבין איך הצליח ב-13 שנים להשאיר חותם על ישראל, ולהפוך לפרק בסיפור שלה, שמלווה אותה עד היום ונוכח כמעט בכל פינה.`,
  ],
]

export default function Lectures() {
  const [activeContentIndex, setActiveContentIndex] = useState(0)

  return (
    <div>
      <header>
        <div>
          <h1>הרצאות</h1>
          <p>סיפורים מופלאים על אומנים גדולים</p>
        </div>
      </header>

      <div id="lectures-topics">
        <menu>
          <button
            className={activeContentIndex === 0 ? "active" : ""}
            onClick={() => setActiveContentIndex(0)}
          >
            אריס סאן
          </button>
          <button
            className={activeContentIndex === 1 ? "active" : ""}
            onClick={() => setActiveContentIndex(1)}
          >
            ביאליק
          </button>
          <button
            className={activeContentIndex === 2 ? "active" : ""}
            onClick={() => setActiveContentIndex(2)}
          >
            פוליקר
          </button>
        </menu>
        <div id="lecture-content">
          <ul>
            {content[activeContentIndex].map((lecture, index) => (
              <li key={index}>{lecture}</li>
            ))}
          </ul>
        </div>
      </div>
    </div>
  )
}
